In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

▲预先执行的代码

In [4]:
df = pd.read_csv('../data/ex15.csv')
df

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
4    E    Male    baseball    71   69    82
5    F    Male      tennis    69   75    84
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80
8    I    Male    baseball    88   76    72

▲  程序清单 7.51 ex15.csv 文件的读取

In [5]:
grouped = df.groupby("sex")
grouped

▲ 程序清单 7.52 DataFrame 对象的 groupby 方法

In [6]:
grouped.groups

{'Female': Int64Index([2, 3, 6, 7], dtype='int64'),
 'Male': Int64Index([0, 1, 4, 5, 8], dtype='int64')}

In [7]:
df.loc[[2,3,6,7],'sex']

2    Female
3    Female
6    Female
7    Female
Name: sex, dtype: object

▲ 程序清单 7.53 GroupBy 对象的 groups 属性

In [8]:
grouped.indices

{'Female': array([2, 3, 6, 7], dtype=int64),
 'Male': array([0, 1, 4, 5, 8], dtype=int64)}

▲ 程序清单 7.54 GroupBy 对象的 indices 属性

In [9]:
grouped.get_group('Female')

  name     sex        club  math  eng  scie
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80

▲ 程序清单 7.55 GroupBy 对象的 get_group 方法

In [10]:
grouped.mean()

         math    eng  scie
sex
Female  83.25  83.25  86.0
Male    80.00  77.80  83.6

▲ 程序清单 7.56 GroupBy 对象的 mean 方法

In [11]:
grouped.count()

        name  club  math  eng  scie
sex
Female     4     4     4    4     4
Male       5     5     5    5     5

▲  程序清单 7.57 GroupBy 对象的 count 方法

In [12]:
grouped['math'].mean()

sex
Female    83.25
Male      80.00
Name: math, dtype: float64

▲ 程序清单 7.58 使用方括号（[ ]）对不同性别的 math 平均分数进行计算

In [13]:
grouped[['math','eng']].mean()

         math    eng
sex
Female  83.25  83.25
Male    80.00  77.80

▲ 程序清单 7.59 使用方括号（[ ]）对列 math 和列 eng 的数据进行处理

In [14]:
grouped = df.groupby(['sex','club'])
grouped.mean()

                   math   eng  scie
sex    club
Female tennis      82.5  85.5  80.5
       volleyball  84.0  81.0  91.5
Male   baseball    79.5  72.5  77.0
       soccer      86.0  84.5  90.0
       tennis      69.0  75.0  84.0

▲程序清单 7.60 基于多个键值的分组

In [15]:
grouped = df.groupby(['sex','club'], as_index=False)
grouped.mean()

      sex        club  math   eng  scie
0  Female      tennis  82.5  85.5  80.5
1  Female  volleyball  84.0  81.0  91.5
2    Male    baseball  79.5  72.5  77.0
3    Male      soccer  86.0  84.5  90.0
4    Male      tennis  69.0  75.0  84.0

▲  程序清单 7.61 groupby 方法和 as_index 参数

In [16]:
classroom = ['1A'] * 2 + ['1B'] * 3 + ['1C'] * 2 + ['1A'] * 2
classroom

['1A', '1A', '1B', '1B', '1B', '1C', '1C', '1A', '1A']

▲ 程序清单 7.62 创建包含类的数据列表

In [17]:
grouped = df.groupby([classroom, 'sex'])
grouped[['math','eng']].max()

           math  eng
   sex
1A Female    77   86
   Male      91   90
1B Female    88   85
   Male      71   69
1C Female    91   93
   Male      69   75

▲ 程序清单 7.63 使用外部数据进行分组

In [18]:
df2 = df.copy()
df2 = df2.set_index('club')
df2

           name     sex  math  eng  scie
club
soccer        A    Male    81   79    91
soccer        B    Male    91   90    89
volleyball    C  Female    77   69    94
tennis        D  Female    88   85    81
baseball      E    Male    71   69    82
tennis        F    Male    69   75    84
volleyball    G  Female    91   93    89
tennis        H  Female    77   86    80
baseball      I    Male    88   76    72

▲  程序清单 7.64 DataFrame 对象和 set_index 方法

In [19]:
df2.groupby(by='club').mean()

            math   eng       scie
club
baseball    79.5  72.5  77.000000
soccer      86.0  84.5  90.000000
tennis      78.0  82.0  81.666667
volleyball  84.0  81.0  91.500000

▲ 程序清单 7.65 基于索引的 name 属性分组

In [20]:
df2.groupby(level=0).mean()

            math   eng       scie
club
baseball    79.5  72.5  77.000000
soccer      86.0  84.5  90.000000
tennis      78.0  82.0  81.666667
volleyball  84.0  81.0  91.500000

▲ 程序清单 7.66 groupby 方法的 level 参数

In [21]:
grouped = df.groupby('sex')

for name, group in grouped:
    print(name)
    print(group[0:2], '\n')

Female
  name     sex        club  math  eng  scie
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81

Male
  name   sex    club  math  eng  scie
0    A  Male  soccer    81   79    91
1    B  Male  soccer    91   90    89

▲ 程序清单 7.67 GroupBy 对象的迭代

In [22]:
for (sex, club), group in df.groupby(['sex','club']):
    print(sex, club)

Female tennis
Female volleyball
Male baseball
Male soccer
Male tennis

▲ 程序清单 7.68 GroupBy 对象的迭代（多个键）

In [23]:
grouped = df.groupby('club')
grouped['math'].describe()

            count  mean        std   min    25%   50%    75%   max
club
baseball      2.0  79.5  12.020815  71.0  75.25  79.5  83.75  88.0
soccer        2.0  86.0   7.071068  81.0  83.50  86.0  88.50  91.0
tennis        3.0  78.0   9.539392  69.0  73.00  77.0  82.50  88.0
volleyball    2.0  84.0   9.899495  77.0  80.50  84.0  87.50  91.0

▲ 程序清单 7.69 GroupBy 对象的 describe 方法

In [24]:
grouped.filter(lambda x: x['math'].mean() > 80)

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
6    G  Female  volleyball    91   93    89

▲ 程序清单 7.70 GroupBy 对象的 filter 方法

In [25]:
df.groupby('club').filter(lambda x: len(x) > 2)

  name     sex    club  math  eng  scie
3    D  Female  tennis    88   85    81
5    F    Male  tennis    69   75    84
7    H  Female  tennis    77   86    80

▲ 程序清单 7.71 GroupBy 对象的 filter 方法和 len 函数

In [26]:
ser_grouped = df.groupby('sex')
ser_grouped['math']

▲  程序清单 7.72 SeriesGroupBy 对象

In [27]:
print(ser_grouped['math'].nlargest(n=1), '\n')
print(ser_grouped['math'].nsmallest(n=1))

sex
Female  6    91
Male    1    91
Name: math, dtype: int64

sex
Female  2    77
Male    5    69
Name: math, dtype: int64

▲ 程序清单 7.73 SeriesGroupBy 对象的 nlargest 方法和 nsmallest 方法

In [28]:
ser_grouped['math'].value_counts()

sex     math
Female  77      2
        88      1
        91      1
Male    69      1
        71      1
        81      1
        88      1
        91      1
Name: math, dtype: int64

▲ 程序清单 7.74 SeriesGroupBy 对象和 value_counts 方法

In [29]:
grouped = df.groupby('sex')
grouped.mean()

         math    eng  scie
sex
Female  83.25  83.25  86.0
Male    80.00  77.80  83.6

In [30]:
grouped.agg('mean')

         math    eng  scie
sex
Female  83.25  83.25  86.0
Male    80.00  77.80  83.6

▲ 程序清单 7.75 GroupBy 对象的 agg 方法

In [31]:
grouped.agg(np.mean)

         math    eng  scie
sex
Female  83.25  83.25  86.0
Male    80.00  77.80  83.6

▲ 程序清单 7.76 agg 方法和 NumPy 数组的 mean 函数

In [32]:
grouped[['math','eng']].agg([np.max,np.min])

       math       eng
       amax amin amax amin
sex
Female   91   77   93   69
Male     91   69   90   69

▲ 程序清单 7.77 agg 方法和多个函数

In [33]:
grouped[['math','eng']].agg([('最大值', np.max),('最小值',np.min)])

       math     eng
        最大值 最小值 最大值 最小值
sex
Female   91  77  93  69
Male     91  69  90  69

▲ 程序清单 7.78 agg 方法和元组

In [34]:
grouped.agg({'math':np.mean,
             'eng':np.max,
             'scie':np.min})

         math  eng  scie
sex
Female  83.25   93    80
Male    80.00   90    72

▲ 程序清单 7.79 agg 方法和字典

In [35]:
def max_min(g):
    return g.max() - g.min()

In [36]:
grouped.agg(max_min)

        math  eng  scie
sex
Female    14   24    14
Male      22   21    19

▲ 程序清单 7.80 agg 方法和用户自定义函数

In [37]:
df.groupby(['sex','club']).agg(['mean','sum'])['math']

                   mean  sum
sex    club
Female tennis      82.5  165
       volleyball  84.0  168
Male   baseball    79.5  159
       soccer      86.0  172
       tennis      69.0   69

▲   程序清单 7.81 agg 方法和多个分组键

In [38]:
df = pd.read_csv('../data/ex16.csv')
df

  name category   sales
0    A    Ramen  120000
1    B  Chinese  100000
2    C  Chinese  320000
3    D    Sushi  120000
4    E    Sushi  290000
5    F    Ramen   80000
6    G    Sushi  610000

▲ 程序清单 7.82 ex16.csv 文件的读取

In [39]:
grouped = df.groupby('category')
grouped['sales'].agg(lambda x: x.mean())

category
Chinese    210000
Ramen      100000
Sushi      340000
Name: sales, dtype: int64

▲  程序清单 7.83 agg 方法和匿名函数

In [40]:
grouped['sales'].transform(lambda x: x.mean())

0    100000
1    210000
2    210000
3    340000
4    340000
5    100000
6    340000
Name: sales, dtype: int64

▲ 程序清单 7.84 GroupBy 对象和 transform 方法

In [41]:
df2 = df.copy()
df2['不同分类的平均'] = grouped.transform(lambda x: x.mean())
df2

  name category   sales  不同分类的平均
0    A    Ramen  120000   100000
1    B  Chinese  100000   210000
2    C  Chinese  320000   210000
3    D    Sushi  120000   340000
4    E    Sushi  290000   340000
5    F    Ramen   80000   100000
6    G    Sushi  610000   340000

▲ 程序清单 7.86 指定的函数与原始 DataFrame 对象大小相同时

In [42]:
df2['万'] = grouped.transform(lambda x: x / 10000)
df2

  name category   sales  不同分类的平均   万
0    A    Ramen  120000   100000  12
1    B  Chinese  100000   210000  10
2    C  Chinese  320000   210000  32
3    D    Sushi  120000   340000  12
4    E    Sushi  290000   340000  29
5    F    Ramen   80000   100000   8
6    G    Sushi  610000   340000  61

▲ 程序清单 7.86 指定的函数与原始 DataFrame 对象大小相同时

In [43]:
df2 = df.copy()
cat_total = df2.groupby('category').sum()
cat_total.columns = ['cat_total']
cat_total

          cat_total
category
Chinese      420000
Ramen        200000
Sushi       1020000

▲ 程序清单 7.87 GroupBy 对象和 sum 方法

In [44]:
df2 = df2.merge(cat_total, left_on='category', right_index=True)
df2['pct'] = df2['sales'] / df2['cat_total']
df2

  name category   sales  cat_total       pct
0    A    Ramen  120000     200000  0.600000
5    F    Ramen   80000     200000  0.400000
1    B  Chinese  100000     420000  0.238095
2    C  Chinese  320000     420000  0.761905
3    D    Sushi  120000    1020000  0.117647
4    E    Sushi  290000    1020000  0.284314
6    G    Sushi  610000    1020000  0.598039

▲ 程序清单 7.88 计算每个类别的销售额比率

In [45]:
df['pct'] = grouped['sales'].transform(lambda x: x / x.sum())
df

  name category   sales       pct
0    A    Ramen  120000  0.600000
1    B  Chinese  100000  0.238095
2    C  Chinese  320000  0.761905
3    D    Sushi  120000  0.117647
4    E    Sushi  290000  0.284314
5    F    Ramen   80000  0.400000
6    G    Sushi  610000  0.598039

▲ 程序清单 7.89 使用 transform 方法计算每个分类的销售额比率

In [46]:
df = pd.read_csv('../data/ex15.csv')
df

  name     sex        club  math  eng  scie
0    A    Male      soccer    81   79    91
1    B    Male      soccer    91   90    89
2    C  Female  volleyball    77   69    94
3    D  Female      tennis    88   85    81
4    E    Male    baseball    71   69    82
5    F    Male      tennis    69   75    84
6    G  Female  volleyball    91   93    89
7    H  Female      tennis    77   86    80
8    I    Male    baseball    88   76    72

▲程序清单 7.90 ex15.csv 文件的读取

In [47]:
%timeit df.groupby('sex').apply(lambda x: x.mean())
%timeit df.groupby('sex').mean()

8.27 ms ± 394 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
1.24 ms ± 58.5 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

▲ 程序清单 7.91 apply 方法和 mean 方法的比较

In [48]:
def ssc(df, col=None):
    temp = (df[col] - df[col].mean()) / df[col].std(ddof=0)
    df['score'] = round(50 + 10 * temp)
    df = df[['name','sex','club',col,'score']]
    return df.sort_values(by='score', ascending=False)

▲ 程序清单 7.92 计算偏差值的 ssc 函数的定义

In [49]:
df2 = df.copy()
ssc(df2, col='math')

  name     sex        club  math  score
1    B    Male      soccer    91   62.0
6    G  Female  volleyball    91   62.0
3    D  Female      tennis    88   58.0
8    I    Male    baseball    88   58.0
0    A    Male      soccer    81   49.0
2    C  Female  volleyball    77   44.0
7    H  Female      tennis    77   44.0
4    E    Male    baseball    71   37.0
5    F    Male      tennis    69   34.0

▲ 程序清单 7.93 计算列 math 的偏差值

In [50]:
df2 = df.copy()
df2.groupby('sex').apply(ssc, col='math')

         name     sex        club  math  score
sex
Female 6    G  Female  volleyball    91   62.0
       3    D  Female      tennis    88   57.0
       2    C  Female  volleyball    77   40.0
       7    H  Female      tennis    77   40.0
Male   1    B    Male      soccer    91   62.0
       8    I    Male    baseball    88   59.0
       0    A    Male      soccer    81   51.0
       4    E    Male    baseball    71   40.0
       5    F    Male      tennis    69   38.0

▲ 程序清单 7.94 GroupBy 对象和 apply 方法

In [51]:
df2 = df.copy()
df2.groupby('club').apply(ssc, col='eng')

             name     sex        club  eng  score
club
baseball   8    I    Male    baseball   76   60.0
           4    E    Male    baseball   69   40.0
soccer     1    B    Male      soccer   90   60.0
           0    A    Male      soccer   79   40.0
tennis     7    H  Female      tennis   86   58.0
           3    D  Female      tennis   85   56.0
           5    F    Male      tennis   75   36.0
volleyball 6    G  Female  volleyball   93   60.0
           2    C  Female  volleyball   69   40.0

▲ 程序清单 7.95 GroupBy 对象的 apply 方法

In [52]:
df2 = df.copy()
df2.loc[3:5,'math'] = np.nan
df2.loc[[0,6,8],'eng'] = np.nan
df2.loc[[1,7],'scie'] = np.nan

▲ 程序清单 7.96 在 DataFrame 对象中代入缺失值

In [53]:
mean = round(df2.mean())
mean

math    84.0
eng     79.0
scie    85.0
dtype: float64

In [54]:
df2.fillna(mean)

  name     sex        club  math   eng  scie
0    A    Male      soccer  81.0  79.0  91.0
1    B    Male      soccer  91.0  90.0  85.0
2    C  Female  volleyball  77.0  69.0  94.0
3    D  Female      tennis  84.0  85.0  81.0
4    E    Male    baseball  84.0  69.0  82.0
5    F    Male      tennis  84.0  75.0  84.0
6    G  Female  volleyball  91.0  79.0  89.0
7    H  Female      tennis  77.0  86.0  85.0
8    I    Male    baseball  88.0  79.0  72.0

▲ 程序清单 7.97 mean 方法和 fillna 方法

In [55]:
df2.groupby('club').mean()

            math   eng  scie
club
baseball    88.0  69.0  77.0
soccer      86.0  90.0  91.0
tennis      77.0  82.0  82.5
volleyball  84.0  69.0  91.5

▲ 程序清单 7.98 groupby 方法和 mean 方法

In [56]:
grouped = df2.groupby('club')
grouped.apply(lambda x: x.fillna(x.mean()))

             name     sex        club  math   eng  scie
club
baseball   4    E    Male    baseball  88.0  69.0  82.0
           8    I    Male    baseball  88.0  69.0  72.0
soccer     0    A    Male      soccer  81.0  90.0  91.0
           1    B    Male      soccer  91.0  90.0  91.0
tennis     3    D  Female      tennis  77.0  85.0  81.0
           5    F    Male      tennis  77.0  75.0  84.0
           7    H  Female      tennis  77.0  86.0  82.5
volleyball 2    C  Female  volleyball  77.0  69.0  94.0
           6    G  Female  volleyball  91.0  69.0  89.0

▲ 程序清单 7.99 使用 apply 方法和匿名函数对缺失值进行置换